{
    "sejarah": [
        {
            "type": "definition",
            "front": "Apakah Hukum Kanun Melaka?",
            "back": "Hukuman setimpal dikenakan terhadap perbuatan jenayah membunuh / menikam / mencuri. Perbuatan jenayah menggugat ketenteraman/keharmonian."
        },
        {
            "type": "definition",
            "front": "Apakah Undang-undang Laut Melaka?",
            "back": "Perbuatan jenayah di atas kapal menggugat ketenteraman/keselamat isi kapal mencuri / membunuh / memberontak."
        },
        {
            "type": "why_how",
            "front": "Mengapakah undang-undang digubal oleh Kesultanan Melayu Melaka?",
            "back": [
                "Menjadikan KMM sebuah kerajaan yang terkenal.",
                "Mewujudkan pentadbiran yang tersusun.",
                "Menjamin perjalanan pemerintahan yang lancar/ cekap.",
                "Menjamin keselamatan KMM.",
                "Mewujudkan keharmonian/ kesejahteraan.",
                "Menggambarkan kebijaksanaan pemerintah.",
                "Mewujudkan sebuah kerajaan yang unggul.",
                "Menjadi panduan dalam kehidupan.",
                "Menjaga hak/kepentingan semua rakyat."
            ]
        },
        {
            "type": "cloze",
            "front": "Sekolah ________ Melayu merupakan salah satu jenis persekolahan semasa di bawah pentadbiran British.",
            "back": "vernakular"
        },
        {
            "type": "cloze",
            "front": "Sekolah ________ Cina merupakan salah satu jenis persekolahan semasa di bawah pentadbiran British.",
            "back": "vernakular"
        },
        {
            "type": "cloze",
            "front": "Sekolah ________ Tamil merupakan salah satu jenis persekolahan semasa di bawah pentadbiran British.",
            "back": "vernakular"
        },
        {
            "type": "definition",
            "front": "Apakah Laporan Barnes 1951?",
            "back": "Menekankan kepentingan sekolah rendah untuk membina satu rupa bangsa penduduk, menganggap Tanah Melayu sebagai tempat tinggal yang kekal dan tumpuan taat setia. Sekolah rendah menggunakan bahasa Melayu atau Bahasa Inggeris sebagai Bahasa pengantar. Sekolah menengah menggunakan bahasa Inggeris sebagai bahasa penghantaran."
        },
        {
            "type": "definition",
            "front": "Apakah Laporan Fenn-Wu 1951?",
            "back": "Mengkaji pendidikan Cina, mencadangkan penambahbaikan untuk menjadikan sekolah Cina sebagai institusi yang memberikan faedah kepada penduduk Tanah Melayu. Sekolah Cina diteruskan secara berasingan dibawah sistem kebangsaan. Pendidikan sekolah Cina harus berorientasikan Tanah Melayu"
        },
        {
            "type": "definition",
            "front": "Apakah Ordinan Pelajaran 1952?",
            "back": "Bertujuan membentuk sistem pendidikan yang menggunakan bahasa rasmi Persekutuan. Semua murid daripada pelbagai bangsa disatukan dalam satu sistem berorientasikan Tanah Melayu. Tanah Melayu mempunyai dua jenis sekolah rendah, sekolah yang menggunakan Bahasa Melayu dan bahasa Inggeris sebagai bahasa pengantar. Bahasa Cina dan Bahasa Tamil diajar sebagai bahasa ketiga di sekolah rendah. Sekolah menengah menggunakan bahasa Inggeris sebagai bahasa pengantar."
        },
        {
            "type": "definition",
            "front": "Apakah Laporan Woodhead di Sarawak dan Sabah 1955?",
            "back": "Memperkasa pendidikan peringkat rendah dan menengah. Menitikberatkan kepentingan bahasa Inggeris sebagai bahasa pengantar. Mewujudkan sistem pembiayaan pendidikan yang teratur."
        },
        {
            "type": "definition",
            "front": "Apakah Penyata Jawatankuasa Pelajaran 1956?",
            "back": "Mengkaji semula sistem pendidikan sedia ada, mengemukakan teras pembentukan sistem pendidikan kebangsaan, memupuk integrasi dan perpaduan rakyat berbilang kaum. Sistem persekolahan yang sama bagi kanak-kanak daripada semua bangsa. Bahasa kebangsaan sebagai bahasa pengantar utama. Kandungan kurikulum yang seragam dan bercorak kebangsaan."
        },
        {
            "type": "cloze",
            "front": "Pelan Induk ________ mempunyai matlamat yang sama dengan dasar pendidikan kebangsaan.",
            "back": "Pendidikan"
        },
        {
            "type": "cloze",
            "front": "Kerjasama Kerajaan Persekutuan dan Kerajaan Negeri meliputi ________.",
            "back": "Pembangunan Sosioekonomi"
        },
        {
            "type": "cloze",
            "front": "Kerjasama Kerajaan Persekutuan dan Kerajaan Negeri meliputi ________.",
            "back": "Perumahan Rakyat"
        },
        {
            "type": "why_how",
            "front": "Bagaimanakah Kerajaan Persekutuan dan Kerajaan Negeri menangani masalah perumahan rakyat?",
            "back": [
                "Kerajaan Persekutuan menubuhkan agensi.",
                "Memberikan bantuan kewangan dan kepakaran kepada kerajaan negeri.",
                "Kerajaan negeri menyediakan tanah untuk pembangunan.",
                "Pembukaan tanah baharu.",
                "Pembangunan In-Situ.",
                "Kerajaan Persekutuan menubuhkan Lembaga Kemajuan Tanah Persekutuan (FELDA).",
                "Menubuhkan Lembaga Penyatuan dan Pemulihan Tanah Persekutuan (FELCRA).",
                "Untuk menyatukan/memulihkan/membangunkan tanah Kerajaan Negeri yang terbiar."
            ]
        },
        {
            "type": "why_how",
            "front": "Bagaimanakah Kerajaan Persekutuan dan Kerajaan Negeri menangani masalah pembangunan wilayah baru?",
            "back": [
                "Pembangunan kawasan yang lebih luas",
                "Contoh agensi yang ditubuhkan: KEDA/ KESEDAR/ KETENGAH/ DARA/ KEJORA/ PERDA/ LKTS/ SALCRA/ SLDB"
            ]
        },
        {
            "type": "why_how",
            "front": "Bagaimanakah Kerajaan Persekutuan dan Kerajaan Negeri menangani masalah pembangunan koridor wilayah?",
            "back": [
                "Perancangan strategik jangka panjang",
                "Memberi tumpuan kepada pembangunan di negeri dan wilayah yang kurang pesat",
                "Mewujudkan keseimbangan pembangunan negeri dan wilayah",
                "Contoh Rancangan Pembangunan Koridor Wilayah: SJER/ NCER/ ECER/ SCORE/ SDC"
            ]
        },
        {
            "type": "why_how",
            "front": "Bagaimanakah Kerajaan Persekutuan dan Kerajaan Negeri menangani masalah penyediaan perumahan rakyat?",
            "back": [
                "Perumahanan awal kemerdekaan",
                "Berkerjasama menyediakan perumahan kos rendah terutama kawasan bandar",
                "Kerajaan Persekutuan menubuhkan Kementerian Kerajaan Tempatan dan Perumahan",
                "Kerajaan Negeri menyediakan tanah yang dijual pada harga rendah",
                "Perumahan untuk mengatasi masalah kemiskinan",
                "Kerajaan Persekutuan melaksanakan Program Perumahan Rakyat (PPR) untuk bina rumah awam di seluruh negara",
                "Kerajaan Negeri tubuhkan agensi pembangunan negeri"
            ]
        },
        {
            "type": "why_how",
            "front": "Mengapakah berlakunya peristiwa rusuhan kaum 13 Mei 1969?",
            "back": [
                "Ketidakseimbangan ekonomi /sosial",
                "Keadaan / keputusan Pilihan Raya Umum Ketiga",
                "Ketegangan bermula dengan kempen pilihan raya",
                "Terdapat parti politik yang menyentuh sensitiviti sesuatu kaum",
                "PKM mempengaruhi penduduk supaya bermusuhan antara kaum",
                "Parti yang bertanding menggunakan sentimen perkauman /keagamaan",
                "Untuk mendapatkan sokongan daripada pengundi",
                "Perarakan kemenangan pilihan raya tidak terkawal",
                "Menimbulkan kekacauan / perbuatan provokatif"
            ]
        },
        {
            "type": "why_how",
            "front": "Jelaskan langkah yang diambil bagi mengatasi masalah rusuhan kaum 13 Mei 1969.",
            "back": [
                "Melalui pengisytiharan darurat",
                "Perlembagaan digantung / Parlimen ditangguhkan",
                "Pusat perlindungan diwujudkan di beberapa tempat",
                "Penguatkuasaan perintah berkurung oleh pihak polis",
                "Orang ramai tidak dibenarkan keluar dan dikehendaki tinggal di kediaman masing -masing",
                "Penubuhan jawatankuasa bertugas untuk Menyusun semula perkhimatan penerangan kerajaan",
                "Semua berita daripada media ditapis bagi memastikan kesahihannya",
                "Memastikan bekalan makanan diperoleh penduduk terutama di pusat perlindungan",
                "Mangsa rusuhan dipindahkan ke pusat perlindungan",
                "Kawasan Kampung Baru dipagar",
                "dijadikan kawasan perintah berkurung",
                "Perlindungan kepada penduduk di kem tentera"
            ]
        },
        {
            "type": "definition",
            "front": "Apakah Majlis Gerakan Negara (MAGERAN)?",
            "back": "Bertanggungjawab mengawal ketenteraman negara, berusaha menyelesaikan masalah perpaduan kaum, ketidakseimbangan ekonomi, mengembalikan keamanan dan undang -undang, menentukan pentadbiran yang licin, mengembalikan keharmonian dan kepercayaan antara kaum dalam negara"
        },
        {
            "type": "why_how",
            "front": "Apakah peranan Raja-raja Melayu dalam mengatasi masalah rusuhan kaum?",
            "back": [
                "Berusaha memulihkan keadaan negara / meminta rakyat bertenang / mematuhi undang-undang",
                "Sultan Idris Shah II menasihati rakyat agar menjaga keamanan",
                "Pemimpin masyarakat / politik negeri Perak menubuhkan Jawatankuasa Muhibah",
                "Jawatankuasa menulis surat merayu penduduk agar bertenang / kekalkan keamanan",
                "Negeri -negeri lain, raja turut rakyat agar bertenang / mematuhi undang -undang"
            ]
        },
        {
            "type": "why_how",
            "front": "Jelaskan tindakan yang dilakukan oleh Bintang Tiga.",
            "back": [
                "Bintang Tiga PKM melalui MPAJA unruk mengambil alih penguasaan di Tanah Melayu.",
                "Bintang Tiga telah menguasai bandar/balai polis / pejabat pentadbiran kerajaan yang ditinggalkan oleh tentera Jepun.",
                "Bintang Tiga menjalankan undang-undang sendiri.",
                "Menggunakan sebuah mahkamah yang dikendalikan oleh komunis.",
                "Menjatuhkan hukuman mati terhadap sesiapa yang bekerjasama dengan Jepun, terutama orang Melayu.",
                "Tindakan Bintang Tiga menyeksa dan membunuh anggota polis/ askar/pegawai daerah / pasukan sukarelawan Melayu",
                "Perbuatan melampau dan mencabar kesabaran orang Melayu.",
                "Selama lebih kurang 14 hari Tanah Melayu berada di bawah penguasaan Bintang Tiga."
            ]
        },
        {
            "type": "why_how",
            "front": "Bagaimanakah reaksi Orang Melayu terhadap keganasan Bintang Tiga?",
            "back": [
                "Orang Melayu bersatu apabila Bintang Tiga mengancam institusi politik/kekeluargaan/ agama Islam.",
                "Gangguan Bintang Tiga dalam urusan keagamaan di surau dan masjid",
                "Orang Melayu membentuk Gerakan Fi-Sabilillah.",
                "Bertujuan mempertahankan maruah harta/ hak /harta/kelangsungan hidup orang Melayu.",
                "Kepimpinan ulama tempatan",
                "Memberikan inspirasi kepada masyarakat Melayu berhadapan dengan kezaliman Bintang Tiga."
            ]
        },
        {
            "type": "why_how",
            "front": "Apakah reaksi pemimpin dan Raja-raja Tanah Melayu terhadap keganasan Bintang Tiga?",
            "back": [
                "Kebangkitan orang Melayu menentang Bintang Tiga yang mencetuskan pergaduhan kaum.",
                "Menyedarkan pemimpin masyarakat dan Raja-raja Melayu tentang kepentingan perdamaian",
                "Usaha Dato'Onn Jaafar",
                "Dato' Onn Jaafar dilantik oleh Sultan Ibrahim sebagai Pegawai Daerah Batu Pahat",
                "Tugas utamanya menamatkan kekacauan dan memulihkan keamanan di Batu Pahat.",
                "Kompromi Dato'Onn Jaafar berjaya memujuk Kiai Salleh membebaskan orang Cina yang ditahan di Parit Raja.",
                "Bintang Tiga pula menamatkan penguasaan mereka di Balai Polis Batu Pahat.",
                "Kedua-dua pihak memberikan kerjasama kepada beliau sebagai Pegawai Daerah untuk mengembalikan keamanan di Johor.",
                "Peranan Raja-raja Melayu Raja-raja Melayu",
                "Berperanan penting dalam usaha menyelesaikan pergaduhan kaum.",
                "Sultan Pahang, Sultan Abu Bakar Ri'ayatuddin Al-Mu'adzam Shah berangkat ke Kuala Lipis untuk nrengingatkan penduduk agar tidak lagi berlaku pergaduhan antara orang Melayu dengan orang Cina.",
                "Sultan Perak, Sultan Abdul Aziz Almustasim Billah Shah juga mengadakan lawatan dan pemantauan ke beberapa daerah bagi memastikan tiada berlaku pergaduhan antara orang Melayu dengan orang Cina."
            ]
        },
        {
            "type": "why_how",
            "front": "Bagaimanakah langkah yang boleh diambil bagi mengekalkan perpaduan dalam kalangan rakyat Malaysia?",
            "back": [
                "Pendidikan seawal usia kanak -kanak melalui didikan oleh ibu bapa",
                "Penerapan nilai perpaduan di Sekolah",
                "Peranan Kerajaan dalam mewujudkan suasana yang harmoni",
                "Melalui aktiviti kemasyarakatan"
            ]
        },
        {
            "type": "why_how",
            "front": "Jelaskan faktor penyerahan Sabah kepada kerajaan British.",
            "back": [
                "Memenuhi kepentingan British",
                "Sabah merupakan negeri yang berpotensi menggantikan jajahan tersebut",
                "Sabah berupaya membekalkan sumber bahan mentah",
                "Kawasan pasaran bagi barangan British",
                "Meneruskan dasar British dalam hubungan luar",
                "Masalah kewangan SBUB"
            ]
        },
        {
            "type": "why_how",
            "front": "Mengapakah rakyat tempatan tidak melakukan penentangan terhadap penyerahan Sabah kepada kerajaan British?",
            "back": [
                "Dasar British",
                "Kekurangan pemimpin yang berkebolehan",
                "Mengehadkan peluang dalam pentadbiran",
                "Kepentingan sosioekonomi penduduk tempatan",
                "Penyerahan Sabah dianggap peluang kepada penduduk tempatan untuk melibatkan diri dalam pentadbiran",
                "Penduduk Sabah tidak memahami tujuan penyerahan tersebut"
            ]
        },
        {
            "type": "why_how",
            "front": "Bagaimanakah mewujudkan kerjasama dalam menjaga kedaulatan negara?",
            "back": [
                "Pemerintah dan rakyat bekerjasama mewujudkan kestabilan politik",
                "Mewujudkan pentadbiran yang cekap dan amanah",
                "Memastikan semua kaum dapat mengecapi kemakmuran ekonomi",
                "Rakyat memberi sokongan kepada dasar-dasar kerajaan",
                "Rakyat sentiasa menjaga keharmonian antara pelbagai kaum",
                "Mematuhi undang-undang negara yang telah dimaktubkan",
                "Mengealakkan daripada menyentuh hal-hal yang boleh mengguris perasaan kaum lain",
                "Menganggotai pasukan keselamatan bagi menguatkan pertahanan negara"
            ]
        },
        {
            "type": "definition",
            "front": "Apakah idea pembentukan Malaysia?",
            "back": "Konsep yang menggabungkan beberapa bekas tanah jajahan British di Asia Tenggara."
        },
        {
            "type": "definition",
            "front": "Apakah Melayu Raya?",
            "back": "Gerakan nasionalis Melayu sebelum Perang Dunia Kedua. Mahu mendapatkan kemerdekaan wilayah Alam Melayu penjajah British, daripada kuasa Belanda dan Amerika Syarikat. Namun, idea ini tidak berjaya dilaksanakan."
        },
        {
            "type": "why_how",
            "front": "Terangkan langkah-langkah pembentukan Malaysia.",
            "back": [
                "Siri lawatan Tunku Abdul Rahman mengadakan lawatan ke Sarawak/Brunei",
                "Jawatankuasa Setia Kawan Malaysia (JSKM) ditubuhkan semasa Persidangan Ahli-ahli Parlimen Komanwel di Singapura",
                "Referendum/Pungutan Suara Singapura",
                "Rundingan London antara kerajaan PTM dengan kerajaan British",
                "Suruhanjaya Cobbold mengandungi wakil kerajaan British / PTM",
                "Jawatankuasa Antara Kerajaan (JAK) diwakili kerajaan British / PTM / Sarawak / Sabah"
            ]
        },
        {
            "type": "definition",
            "front": "Apakah Dasar Pembangunan Nasional (DPN)?",
            "back": "Dasar ekonomi Malaysia yang telah dilancarkan oleh Y.A.B Dato’Seri Dr. Mahathir Mohamad, Perdana Menteri Malaysia pada 17 Jun 1991 dan telah digunakan dari tahun 1991 hingga 2000."
        },
        {
            "type": "why_how",
            "front": "Jelaskan strategi Dasar Pembangunan Nasional (DPN).",
            "back": [
                "Pelibatan aktif pihak swasta dalam Pembangunan ekonomi negara",
                "Melaksanakan pogram penanaman semula",
                "Penggunaan sains dan teknologi",
                "Meningkatkan pemilikan saham bumiputera",
                "Memberikan insentif serta kemudahan pendidikan untuk kemajuan masyarakat miskin tanpa mengira kaum",
                "Mewujudkan masyarakat perdagangan damn perindustrian bumiputera",
                "Membentuk masyarakat yang berdisiplin dan progresif",
                "Menyediakan dan menambah baik kemudahan asas",
                "Pembangunan mapan tanpa mengabaikan alam sekitar"
            ]
        },
        {
            "type": "why_how",
            "front": "Terangkan usaha yang dilaksanakan kerajaan dalam Dasar Pembangunan Nasional.",
            "back": [
                "Pembasmian Kemiskinan Pemberian subsidi/ sokongan",
                "Penyusunan semula Masyarakat Meningkatkan tenaga kerja bumiputera dalam sektor moden",
                "Penyusunan semula modal saham Peruntukan sejumlah saham projek swasta kepada bumiputera",
                "Pembangunan wilayah meningkatkan integrasi ekonomi antara negeri"
            ]
        },
        {
            "type": "why_how",
            "front": "Apakah matlamat penggubalan dasar luar?",
            "back": [
                "Dasar ini mempengaruhi tindakan negara dalam menghadapi suasana",
                "Perkembangan politik wilayah, serantau dan antarabangsa",
                "Kejayaan dasar luar Malaysia dapat diukur dengan kerjasama erat",
                "Dalam bidang ekonomi / politik / pertahanan serta kebudayaan",
                "Persediaan asas menubuhkan Kementerian Luar Negeri",
                "Wisma Putra berperanan menggubal dasar luar serta menjaga kepentingan nasional Malaysia",
                "Mempertahankan kemerdekaan dan kedaulatan negara",
                "Melindungi kepentingan nasional",
                "Mempertahankan dan memajukan kepentingan Malaysia",
                "Memupuk hubungan baik dengan negara luar",
                "Menghadapi perkembangan serta cabaran politik, ekonomi dan sosial"
            ]
        },
        {
            "type": "definition",
            "front": "Apakah ZOPFAN?",
            "back": "Deklarasi Zone of Peace Freedom and Neutrality. Diumumkan pada tahun 1971 di Kuala Lumpur"
        },
        {
            "type": "why_how",
            "front": "Huraikan pelibatan Malaysia dalam ASEAN.",
            "back": [
                "Zon Aman, Bebas dan Berkecuali (ZOPFAN)",
                "Penyelesaian Konflik Serantau",
                "Kerjasama Ekonomi",
                "Kerjasama Sosial"
            ]
        },
        {
            "type": "why_how",
            "front": "Bagaimanakah pemimpin ASEAN dapat menjalinkan persahabatan serantau yang kukuh?",
            "back": [
                "Mengukuhkan perpaduan kaum",
                "Memastikan politik negara stabil",
                "Memajukan bidang Pendidikan negara",
                "Pemimpin/rakyat tidak terlibat dengan amalan rasuah",
                "Memperkukuhkan jati diri generasi muda",
                "Memperkukuhkan ekonomi negara",
                "Memantapkan sistem keselamatan/pertahanan negara",
                "Menghayati prinsip Rukun Negara"
            ]
        }
    ],
    "history": [
        {
            "type": "definition",
            "front": "What were the Carbonari?",
            "back": "A secret revolutionary society that supported Italian nationalism and took part in the failed revolution of 1820. They wanted a constitutional government."
        },
        {
            "type": "why_how",
            "front": "Why was the Austro-Prussian War of 1866 important for Italian unification?",
            "back": [
                "Italy agreed to declare war on Austria if Prussia did.",
                "Prussia's victory resulted in Italy being given Venetia in the Peace of Prague.",
                "It took Italy one step closer to complete unification, with only Rome remaining."
            ]
        },
        {
            "type": "cloze",
            "front": "Garibaldi handed over his conquests to Victor _____, almost completing Italian unification.",
            "back": "Emmanuel"
        },
        {
            "type": "definition",
            "front": "What was the issue of the Spanish succession, 1868–70?",
            "back": "The question of who should succeed Queen Isabella after she was overthrown by a revolution."
        },
        {
            "type": "cloze",
            "front": "Bismarck altered a telegram from William to Napoleon so that it appeared _____ to the French.",
            "back": "insulting"
        },
        {
            "type": "why_how",
            "front": "Why was the meeting between Austria and Prussia in Olmütz in 1850 important?",
            "back": [
                "It showed Austria was gaining strength in Germany at the expense of Prussia.",
                "Prussia backed down and agreed to abandon its plan for a Prussian Union.",
                "It avoided war between Prussia and Austria."
            ]
        },
        {
            "type": "cloze",
            "front": "Prussia agreed to abandon the plan for a _____ Union at Olmütz.",
            "back": "Prussian"
        },
        {
            "type": "definition",
            "front": "How did President Grant support Reconstruction?",
            "back": "He signed the Fifteenth Amendment guaranteeing universal male suffrage, the Force Acts helped defeat the Ku Klux Klan and established the concept of ‘civil rights’."
        },
        {
            "type": "cloze",
            "front": "President Grant signed the _____ Amendment which guaranteed universal male suffrage.",
            "back": "Fifteenth"
        },
        {
            "type": "why_how",
            "front": "Why did the acquisition of new territories in the first half of the nineteenth century create problems for US governments?",
            "back": [
                "The main problem was slavery.",
                "Abolitionists thought acquiring new land was simply a way of spreading slavery."
            ]
        },
        {
            "type": "cloze",
            "front": "The 1850 _____ was an attempt to find a way around the slavery issue when Southern states started to threaten to secede.",
            "back": "Compromise"
        },
        {
            "type": "why_how",
            "front": "Why was the acquisition of new territories in the first half of the nineteenth century create problems for US governments?",
            "back": [
                "Americans were divided over whether the US should acquire the whole of the continent.",
                "Some Americans thought some of the acquisitions represented imperialism.",
                "The Louisiana Purchase was regarded by some as unconstitutional."
            ]
        },
        {
            "type": "why_how",
            "front": "Why was the South defeated in the Civil War?",
            "back": [
                "The greater resources of the North.",
                "The North had more men, more money and much larger industrial resources to produce armaments.",
                "The North did not suffer much from the war."
            ]
        },
        {
            "type": "why_how",
            "front": "Why was the South defeated in the Civil War?",
            "back": [
                "The South had its cotton exports.",
                "The South did well at first – the victory at Bull Run.",
                "The South might have got support from Europe."
            ]
        },
        {
            "type": "definition",
            "front": "Describe the role of the United States in Cuba between the Treaty of Paris (1898) and 1906.",
            "back": "The US announced that it would rule Cuba and set up a US military government. The Platt Amendment was introduced. US occupied Cuba after a rebellion in 1906."
        },
        {
            "type": "cloze",
            "front": "The _____ Amendment stated the US would depart Cuba if US kept military bases and could intervene when it wanted.",
            "back": "Platt"
        },
        {
            "type": "why_how",
            "front": "Why did the Spanish–American War break out in 1898?",
            "back": [
                "The sinking of the USS Maine.",
                "Spain’s repressive behaviour towards Cubans.",
                "Reporting of Spanish repression in US newspapers.",
                "Cuban struggle for independence."
            ]
        },
        {
            "type": "why_how",
            "front": "Why did the Spanish–American War break out in 1898?",
            "back": [
                "Popular demand for US intervention.",
                "US demanded withdrawal of Spanish troops from Cuba."
            ]
        },
        {
            "type": "why_how",
            "front": "Why was Leopold II’s rule in the Congo typical of European imperialism in Africa?",
            "back": [
                "Exploitation of natural resources.",
                "Regarded Africans as inferior.",
                "Belief in the right to take over parts of Africa.",
                "Desire to make money out of Africa."
            ]
        },
        {
            "type": "why_how",
            "front": "Why was Leopold II’s rule in the Congo NOT typical of European imperialism in Africa?",
            "back": [
                "Leopold put nothing back into the Congo.",
                "Other Europeans felt a duty towards Africans and spread Christianity.",
                "Other Europeans built transport systems and schools."
            ]
        },
        {
            "type": "cloze",
            "front": "In the Treaty of _____, Germany lost Upper Silesia, West Prussia, Posen, and the Polish Corridor.",
            "back": "Versailles"
        },
        {
            "type": "definition",
            "front": "What land did Germany lose in the Treaty of Versailles?",
            "back": "Germany lost Upper Silesia, West Prussia, Posen, Polish Corridor, Memel, Danzig, North Schleswig, Alsace-Lorraine, Saarland, Eupen, Malmedy, Moresnet, Hultschin, Estonia, Latvia, Lithuania, and overseas colonies."
        },
        {
            "type": "why_how",
            "front": "Why were Lloyd George and Clemenceau suspicious of Wilson’s Fourteen Points?",
            "back": [
                "Lloyd George and Clemenceau were more interested in the self-interest of their own countries.",
                "Lloyd George was not keen on self-determination because of the British Empire.",
                "Lloyd George wanted Germany to be punished harshly over its navy and colonies."
            ]
        },
        {
            "type": "why_how",
            "front": "Why were Lloyd George and Clemenceau suspicious of Wilson’s Fourteen Points?",
            "back": [
                "Clemenceau was not keen on self-determination, for example, his demands over the Rhineland.",
                "Clemenceau wanted German colonies handed over to France.",
                "The Fourteen Points were based on ideals, but Lloyd George and Clemenceau had to deal with practicalities."
            ]
        },
        {
            "type": "why_how",
            "front": "Why were the economic consequences of the Treaty of Versailles more important for Germany than the political consequences?",
            "back": [
                "Germany had to pay enormous reparations and in 1922 it did not pay anything.",
                "France and Belgium went into the Ruhr and took what they were owed.",
                "Money became worthless and prices went up."
            ]
        },
        {
            "type": "why_how",
            "front": "Why were the political consequences of the Treaty of Versailles more important for Germany than the economic consequences?",
            "back": [
                "Many people in Germany blamed the harsh terms of the Treaty of Versailles on the Weimar Republic and the government.",
                "Many ex-soldiers joined the Freikorps led by Kapp. In 1920, they tried to bring down the government through a coup in Berlin.",
                "The German army refused to support the government."
            ]
        },
        {
            "type": "definition",
            "front": "What was the Saar plebiscite of 1935?",
            "back": "A vote written into the Treaty of Versailles, held after 15 years, to decide who should control the Saar region (France, Germany, or stay separate).  The people voted to rejoin Germany."
        },
        {
            "type": "why_how",
            "front": "Why did Britain go to war over the German invasion of Poland?",
            "back": [
                "The policy of appeasement was not working.",
                "Hitler broke the promises he made at Munich.",
                "The policy of appeasement ended after the German takeover of Czechoslovakia.",
                "It looked as if Hitler was out to dominate the whole of Europe."
            ]
        },
        {
            "type": "cloze",
            "front": "The policy of _____ ended after the German takeover of Czechoslovakia.",
            "back": "appeasement"
        },
        {
            "type": "why_how",
            "front": "Why was the 1939 Pact between Germany and the Soviet Union surprising?",
            "back": [
                "Hitler regarded Slavs as subhuman.",
                "Hitler hated communism.",
                "Germany and the Soviet Union had been enemies.",
                "The Soviet Union had made a Mutual Assistance Pact with France."
            ]
        },
        {
            "type": "why_how",
            "front": "Why was the 1939 Pact between Germany and the Soviet Union not surprising?",
            "back": [
                "It protected Hitler from having to fight on two fronts.",
                "It meant the Soviet Union would not attack Germany.",
                "It gave Hitler half of Poland.",
                "It helped Hitler achieve Lebensraum."
            ]
        },
        {
            "type": "why_how",
            "front": "What happened in the Greek Civil War?",
            "back": [
                "There were two rival groups, monarchists and communists.",
                "The monarchists were supported by the US and Britain.",
                "The communists were supported by the Soviet Union.",
                "There was civil war in Athens which the British put down."
            ]
        },
        {
            "type": "cloze",
            "front": "In 1949 the _____ army defeated the communists in the Greek Civil War.",
            "back": "Greek"
        },
        {
            "type": "why_how",
            "front": "Why was Stalin worried by the introduction by Western powers of a new currency in Germany in 1948?",
            "back": [
                "The new currency was aimed at helping a German economic recovery.",
                "Stalin did not want Germany to recover.",
                "Stalin feared a strong Germany.",
                "Stalin did not want the western part of Germany to become more prosperous than the eastern zone."
            ]
        },
        {
            "type": "why_how",
            "front": "Why was the new currency in Germany in 1948 a threat to Stalin?",
            "back": [
                "The new currency was a step towards uniting the western zones.",
                "Stalin thought it would make capitalism seem superior to communism."
            ]
        },
        {
            "type": "why_how",
            "front": "Which was more of a threat to the Soviet Union: the Truman Doctrine or the Marshall Plan?",
            "back": [
                "The Truman Doctrine was designed to stop Soviet control spreading/ containing communism.",
                "The Truman Doctrine meant the US would protect countries against communism.",
                "Marshall Aid worried Stalin more than the Truman Doctrine because he saw it as an American plot.",
                "Marshall Aid was offered to eastern European countries."
            ]
        },
        {
            "type": "why_how",
            "front": "Which was more of a threat to the Soviet Union: the Truman Doctrine or the Marshall Plan?",
            "back": [
                "Marshall Aid could put eastern European countries under the economic control of the US.",
                "Stalin banned eastern European countries from taking Marshall Aid.",
                "Stalin set up Comecon to give eastern Europe aid."
            ]
        },
        {
            "type": "definition",
            "front": "Who was Alexander Dubček?",
            "back": "He was leader of Czechoslovakia who introduced 'Socialism with a human face' in 1968, including reforms like freedom of speech. His period of reforms was called the 'Prague Spring'."
        },
        {
            "type": "cloze",
            "front": "Alexander Dubček introduced 'Socialism with a _____ face'.",
            "back": "human"
        },
        {
            "type": "why_how",
            "front": "Why did the Soviet Union respond violently to opposition in Hungary in 1956?",
            "back": [
                "There was a great deal of resentment against the Soviet Union in Hungary.",
                "Nagy’s reforms such as free elections and private ownership seemed to undermine communism.",
                "Nagy planned to leave the Warsaw Pact."
            ]
        },
        {
            "type": "cloze",
            "front": "_____ planned to leave the Warsaw Pact in Hungary in 1956.",
            "back": "Nagy"
        },
        {
            "type": "why_how",
            "front": "Who was more responsible for the collapse of Soviet control in Eastern Europe: Walesa or Gorbachev?",
            "back": [
                "Walesa campaigned for the rights of workers.",
                "Walesa put forward 21 Demands.",
                "Walesa gained support from the West.",
                "Walesa showed that people power could threaten communist governments."
            ]
        },
        {
            "type": "why_how",
            "front": "Who was more responsible for the collapse of Soviet control in Eastern Europe: Walesa or Gorbachev?",
            "back": [
                "Gorbachev encouraged reform in Eastern Europe.",
                "Gorbachev introduced Glasnost and Perestroika.",
                "Gorbachev said he would not back up communist governments in trouble.",
                "Gorbachev withdrew troops from Afghanistan."
            ]
        },
        {
            "type": "definition",
            "front": "Describe Japan’s contribution to the Allied war effort during WWI.",
            "back": "Japan seized German possessions in the Pacific and East Asia, destroyed the German navy in Chinese waters, helped suppress a mutiny by Indian troops against Britain and captured the German base at Qingdao in northern China."
        },
        {
            "type": "why_how",
            "front": "Why did the Arab Revolt break out in 1916?",
            "back": [
                "The British thought it would help bring the Ottoman Empire down.",
                "It was based on an agreement between the British and the Arabs.",
                "To create a unified Arab state.",
                "To break away from Ottoman control."
            ]
        },
        {
            "type": "why_how",
            "front": "Why did the Arab Revolt break out in 1916?",
            "back": [
                "To encourage Arab nationalism.",
                "The leadership of Hussein bin Ali."
            ]
        },
        {
            "type": "why_how",
            "front": "How important was the contribution of British Empire troops to the Allied war effort?",
            "back": [
                "The British Empire sent about 4 million troops to fight in the war.",
                "The Canadians were very important in the Allied offensive at the end of the war.",
                "South African troops fought at the Somme."
            ]
        },
        {
            "type": "why_how",
            "front": "How important was the contribution of British Empire troops to the Allied war effort?",
            "back": [
                "The British and French did most of the fighting on the Western Front.",
                "The arrival of the Americans on the Western Front was crucial."
            ]
        },
        {
            "type": "definition",
            "front": "Describe what happened in the Battle of Jutland.",
            "back": "The Germans wanted to lure the British fleet out into the North Sea.  German ships sank HMS Indefatigable and HMS Queen Mary. The British inflicted heavy damage on German ships. Germany lost 11 ships.  Britain lost 14 ships."
        },
        {
            "type": "why_how",
            "front": "Why was the defeat of Russia important to the course of WWI?",
            "back": [
                "Large numbers of German soldiers could fight in the west.",
                "Large amounts of German armaments were moved to the Western Front giving the Germans an advantage over the Allies.",
                "Germany no longer had to fight on two fronts at once."
            ]
        },
        {
            "type": "why_how",
            "front": "Why was the defeat of Russia important to the course of WWI?",
            "back": [
                "The extra German troops in the west allowed it to launch the Ludendorff Offensive in 1918.",
                "It made the arrival of American troops even more important."
            ]
        },
        {
            "type": "why_how",
            "front": "How far was the U-boat campaign the most important development in WWI?",
            "back": [
                "Britain had to introduce rationing.",
                "Britain was running short of food.",
                "Large numbers of merchant ships were being sunk.",
                "The convoy system was adopted."
            ]
        },
        {
            "type": "why_how",
            "front": "How far was the U-boat campaign the most important development in WWI?",
            "back": [
                "By 1917, Germany was short of food and supplies.",
                "Germany’s ports were blockaded.",
                "The British navy had control of the North Sea.",
                "The turnip winter of 1917.",
                "Riots and strikes in Germany."
            ]
        },
        {
            "type": "definition",
            "front": "Describe the events in 1932–33 that led to Hitler’s appointment as Chancellor in January 1933.",
            "back": "Hindenburg remained president after elections. The Nazis became the largest party in the Reichstag. Von Papen failed to find support as chancellor. Von Schleicher became chancellor but did not have enough support. Von Papen persuaded Hindenburg to appoint Hitler."
        },
        {
            "type": "why_how",
            "front": "Why did the Nazis have little success before 1930?",
            "back": [
                "Stresemann’s policies from 1923 to 1929.",
                "Economic prosperity in Weimar.",
                "Political stability.",
                "Cultural revival."
            ]
        },
        {
            "type": "why_how",
            "front": "Why did the Nazis have little success before 1930?",
            "back": [
                "Germany’s international reputation had recovered.",
                "No reason to vote for an extreme right-wing party.",
                "The popularity of the Social Democrats."
            ]
        },
        {
            "type": "why_how",
            "front": "How far was the Night of the Long Knives was the most important factor in Hitler’s consolidation of power in 1933–34?",
            "back": [
                "Threat from Rohm and the SA.",
                "The strength of the SA.",
                "Rohm’s disagreement with Hitler over policies.",
                "The army feared the SA."
            ]
        },
        {
            "type": "why_how",
            "front": "How far was the Night of the Long Knives was the most important factor in Hitler’s consolidation of power in 1933–34?",
            "back": [
                "People became fearful of the Communists.",
                "Hitler was able to get special emergency powers from Hindenburg.",
                "The Nazis did well in the elections."
            ]
        },
        {
            "type": "why_how",
            "front": "Describe how women helped the German war effort.",
            "back": [
                "They worked in factories producing weapons.",
                "They took men’s jobs when the men went to war.",
                "They did administrative jobs in the armed forces.",
                "They worked in agriculture."
            ]
        },
        {
            "type": "why_how",
            "front": "Describe how women helped the German war effort.",
            "back": [
                "As Germany prepared for war, women had to work a Duty Year on a farm or in a factory.",
                "They became nurses.",
                "They provided labour in annual summer camps.",
                "They worked as tram/train drivers."
            ]
        },
        {
            "type": "why_how",
            "front": "Why did Hitler attach much importance to the German family?",
            "back": [
                "Hitler wanted to increase the birth rate.",
                "To produce more Aryan children.",
                "The mother would bring up loyal children.",
                "The family gave stability to German society."
            ]
        },
        {
            "type": "why_how",
            "front": "Why did Hitler attach much importance to the German family?",
            "back": [
                "Men were to work and protect their family.",
                "Women were to stay at home and nurture their family.",
                "Hitler wanted more soldiers.",
                "To help Germany conquer other countries."
            ]
        },
        {
            "type": "why_how",
            "front": "How far was the Hitler Youth popular with the young people of Germany?",
            "back": [
                "Most German young people joined.",
                "The activities were exciting and fun.",
                "It gave them a sense of belonging.",
                "It gave them some freedom from their parents’ rules and ideas."
            ]
        },
        {
            "type": "why_how",
            "front": "How far was the Hitler Youth popular with the young people of Germany?",
            "back": [
                "Many did not join even after it became compulsory.",
                "During the war it became less enjoyable.",
                "Some young people joined other groups like the Edelweiss Pirates/Swing movement/White Rose movement."
            ]
        },
        {
            "type": "definition",
            "front": "What was the Kronstadt Rising?",
            "back": "A mutiny by sailors at the Kronstadt naval base in 1921 against the Bolsheviks due to food shortages and a belief that the Bolsheviks had drifted from true communism. It was crushed by the Red Army and led to the NEP."
        },
        {
            "type": "why_how",
            "front": "Why was there a civil war in Russia?",
            "back": [
                "The Allies sent troops to force Russia back into the war.",
                "Landlords and others who had lost money in the revolution wanted change.",
                "Groups opposed to Bolshevik ideas such as liberals and social democrats."
            ]
        },
        {
            "type": "why_how",
            "front": "Why was there a civil war in Russia?",
            "back": [
                "Supporters of the Tsar wanted a return of the Romanovs.",
                "Some from the left opposed the Treaty of Brest-Litovsk.",
                "It was caused by the Bolshevik Revolution of 1917."
            ]
        },
        {
            "type": "why_how",
            "front": "How far was the New Economic Policy (NEP) a success?",
            "back": [
                "Grain production went up.",
                "Trade with other countries increased.",
                "There was less discontent and fewer strikes.",
                "Factory production increased."
            ]
        },
        {
            "type": "why_how",
            "front": "How far was the New Economic Policy (NEP) a success?",
            "back": [
                "Nepmen exploited people and became rich.",
                "Farming was not modernised.",
                "It was seen by some Bolsheviks as a move away from communist ideas.",
                "Growing inequality between peasants."
            ]
        },
        {
            "type": "definition",
            "front": "Describe how villages were collectivised in Russia.",
            "back": "A propaganda campaign was used. The government sent officials to force peasants to agree. Large farms were created by putting the land of many peasants together. The peasants had to work to government targets. The kulaks were eliminated as a class."
        },
        {
            "type": "why_how",
            "front": "Why did industrial production increase under Stalin?",
            "back": [
                "The Five-Year Plans.",
                "Workers were bombarded with propaganda.",
                "Tight government control.",
                "Clear targets set."
            ]
        },
        {
            "type": "why_how",
            "front": "Why did industrial production increase under Stalin?",
            "back": [
                "Foreign engineers called in to supervise the work.",
                "The example of Stakhanov.",
                "More women added to the workforce.",
                "Strict discipline with workers having to work very hard."
            ]
        },
        {
            "type": "why_how",
            "front": "How far had the lives of Russians improved by the mid-1930s?",
            "back": [
                "Few consumer goods.",
                "Quality of new housing for industrial workers was poor.",
                "Discipline at work was harsh with severe punishments.",
                "Wages fell."
            ]
        },
        {
            "type": "why_how",
            "front": "How far had the lives of Russians improved by the mid-1930s?",
            "back": [
                "More women could work.",
                "Free health care.",
                "Paid holidays.",
                "Provision of nurseries so mothers could work."
            ]
        },
        {
            "type": "definition",
            "front": "What was the ‘Red Scare’ in the United States?",
            "back": "Alarm in America at the 1917 Russian Revolution and fear of communism and that immigrants were bringing radical political ideas such as anarchism with them, the strikes of 1919 made Americans more fearful."
        },
        {
            "type": "why_how",
            "front": "Why did the cinema grow in popularity during the 1920s?",
            "back": [
                "It was very inexpensive.",
                "Americans had more leisure time.",
                "The attraction of big stars.",
                "Incomes were going up in the ‘boom’.",
                "The economic boom."
            ]
        },
        {
            "type": "why_how",
            "front": "Why did the cinema grow in popularity during the 1920s?",
            "back": [
                "An escape from their everyday lives.",
                "The arrival of ‘talkies’.",
                "People could socialise in cinemas.",
                "More people had cars so they could drive to cinemas."
            ]
        },
        {
            "type": "why_how",
            "front": "Which was more of a problem for the United States in the 1920s: gangsterism or the Ku Klux Klan?",
            "back": [
                "The gangsters supplied the illegal speakeasies with alcohol.",
                "The gangsters largely killed each other.",
                "There was the St. Valentine’s Massacre.",
                "The gangsters corrupted policemen and judges."
            ]
        },
        {
            "type": "why_how",
            "front": "Which was more of a problem for the United States in the 1920s: gangsterism or the Ku Klux Klan?",
            "back": [
                "The KKK was revived after ‘The Birth of a Nation’ in 1915.",
                "The KKK had support among politicians.",
                "The KKK attacked Jews, Catholics and foreigners.",
                "Members of the KKK were often found not guilty in Southern courts."
            ]
        },
        {
            "type": "why_how",
            "front": "Describe how Roosevelt reacted to the Supreme Court decisions of 1935–36 about the New Deal.",
            "back": [
                "He was angry that the Supreme Court acted against the New Deal.",
                "He asked Congress to let him appoint six new Supreme Court judges.",
                "He claimed the judges were too old and were reactionary.",
                "He wanted judges sympathetic to the New Deal."
            ]
        },
        {
            "type": "why_how",
            "front": "Why did Roosevelt do so much in the ‘Hundred Days’ of 1933?",
            "back": [
                "The situation in the USA was so bad with many people unemployed.",
                "This was because there were so many people in poverty.",
                "It was important the banks were saved.",
                "It was to get the USA out of depression."
            ]
        },
        {
            "type": "why_how",
            "front": "Why did Roosevelt do so much in the ‘Hundred Days’ of 1933?",
            "back": [
                "He wanted to improve urgently agriculture and industry.",
                "It was important to let people know that something was happening.",
                "He had made promises in the election campaign.",
                "It was important to restore confidence in the economy as quickly as possible."
            ]
        },
        {
            "type": "why_how",
            "front": "Why was there opposition to the New Deal?",
            "back": [
                "Powerful people like businessmen and the wealthy did not like the New Deal.",
                "Critics said it was a form of socialism.",
                "Critics thought Roosevelt was acting like a dictator.",
                "Critics did not like government interference in business or industry."
            ]
        },
        {
            "type": "why_how",
            "front": "Why was there opposition to the New Deal?",
            "back": [
                "Businessmen thought there were too many codes and regulations.",
                "There was opposition because of the support for trade unions.",
                "Critics could see there were still many people that were poor.",
                "Democrats did not think he was doing enough for the poor."
            ]
        },
        {
            "type": "why_how",
            "front": "Describe relations between Japan and the United States in the period before the attack on Pearl Harbor.",
            "back": [
                "Relations were not good because of Japanese expansion.",
                "Japan lacked oil and other natural resources.",
                "The US wanted an ‘Open Door’ policy towards China.",
                "Japan invaded Manchuria."
            ]
        },
        {
            "type": "why_how",
            "front": "Describe relations between Japan and the United States in the period before the attack on Pearl Harbor.",
            "back": [
                "The US announced it would stop selling Japan materials that could be used for war.",
                "In 1940 an expansionist government came to power.",
                "Japan demanded Britain close the Burma Road.",
                "Japan invaded Indochina."
            ]
        },
        {
            "type": "why_how",
            "front": "Why were the British defeated in Malaya?",
            "back": [
                "Japan sent their best generals and troops to Malaya.",
                "The sinking of the Prince of Wales and Repulse.",
                "The Japanese moved so quickly by using bicycles.",
                "The British defences/troops were unprepared."
            ]
        },
        {
            "type": "why_how",
            "front": "Why were the British defeated in Malaya?",
            "back": [
                "They used collapsible boats to outflank the British.",
                "The British had ignored warnings that an attack might come at Songkhla and Kota Bharu.",
                "The British assumed fast progress through the jungle was not possible.",
                "There was a lack of air cover for the British."
            ]
        },
        {
            "type": "why_how",
            "front": "How far was the Japanese attack on Pearl Harbor a success?",
            "back": [
                "Large parts of the US fleet were destroyed.",
                "Many US airplanes were destroyed.",
                "It was a big propaganda victory for the Japanese.",
                "It showed the US was not ready for such an attack."
            ]
        },
        {
            "type": "why_how",
            "front": "How far was the Japanese attack on Pearl Harbor a success?",
            "back": [
                "The US aircraft carriers were not at Pearl Harbor.",
                "The US declared war on Japan.",
                "It gave the US a chance to rebuild its fleet.",
                "The attack united the US behind war."
            ]
        },
        {
            "type": "definition",
            "front": "What was ‘island-hopping’?",
            "back": "The American military strategy in the Pacific during World War II, involving bypassing Japanese strongholds and seizing lightly defended islands to move across the central Pacific quickly."
        },
        {
            "type": "why_how",
            "front": "Why did the Allies consider it important to hold war crimes trials?",
            "back": [
                "This was because the war crimes of the Nazis had been so terrible.",
                "To deter future aggression and war crimes.",
                "To educate the German people of the true extent of the atrocities.",
                "To discredit Nazism and denazify Germany."
            ]
        },
        {
            "type": "why_how",
            "front": "How far did Germany collapsed in 1945 because of the Russian advance from the East?",
            "back": [
                "By 1945, Germany was being attacked on two fronts at once.",
                "By 1945, Germany was exhausted and did not have the resources to defend itself.",
                "The Russians had enormous numbers of men and resources to throw at Germany.",
                "After D-Day, the Allies advanced quickly through France to the German border."
            ]
        }
    ]
}